#define CONCAT__(A, B) A##B
#define CONCAT_(A, B) CONCAT__(A, B)
#define CONCAT(A, B) CONCAT_(A, B)

#define ASSERT(E) ((E) ? 1 : *(volatile int*)0)
#define STATIC_ASSERT(E) static struct { int static_ass : ((E) ? 1 : -1); } CONCAT(StaticAssert_, __LINE__)
#define NOT_IMPLEMENTED ASSERT(!"NOT_IMPLEMENTED")

typedef __INT8_TYPE__  s8;
typedef __INT16_TYPE__ s16;
typedef __INT32_TYPE__ s32;
typedef __INT64_TYPE__ s64;

STATIC_ASSERT(sizeof(s8)  == 1);
STATIC_ASSERT(sizeof(s16) == 2);
STATIC_ASSERT(sizeof(s32) == 4);
STATIC_ASSERT(sizeof(s64) == 8);

typedef __UINT8_TYPE__  u8;
typedef __UINT16_TYPE__ u16;
typedef __UINT32_TYPE__ u32;
typedef __UINT64_TYPE__ u64;

STATIC_ASSERT(sizeof(u8)  == 1);
STATIC_ASSERT(sizeof(u16) == 2);
STATIC_ASSERT(sizeof(u32) == 4);
STATIC_ASSERT(sizeof(u64) == 8);

typedef s64 sint;
typedef u64 uint;

typedef s64 smm;
typedef u64 umm;

typedef float f32;
typedef double f64;

STATIC_ASSERT(sizeof(f32) == 4);
STATIC_ASSERT(sizeof(f64) == 8);

typedef float _Complex c32;
typedef double _Complex c64;

STATIC_ASSERT(sizeof(c32) == 8);
STATIC_ASSERT(sizeof(c64) == 16);

typedef u8 bool;
#define false 0
#define true 1

#define ARRAY_SIZE(A) (sizeof(A)/((sizeof(A)%sizeof(0[A]) == 0)*sizeof(0[A])))
#define OFFSETOF(T, E) (u8)(&((T*)0)->E)
#define ALIGNOF(T) OFFSETOF(struct { char c; T t; }, t)

#define IS_POW2(N) ((N) != 0 && (((N)-1)&(N)) == 0)

typedef struct String
{
	u8* data;
	umm size;
} String;

#define STRING(S) (String){ .data = (u8*)(S), .size = sizeof(S)-1 }
#define MSF_STRING(S) { .data = (u8*)(S), .size = sizeof(S)-1 }

bool
Char_IsAlpha(u8 c)
{
	return (u8)((c&0xDF) - 'A') <= (u8)('Z'-'A');
}

bool
Char_IsHexAlpha(u8 c)
{
	return (u8)((c&0xDF) - 'A') <= (u8)('F'-'A');
}

bool
Char_IsDigit(u8 c)
{
	return (u8)(c - '0') < (u8)(10);
}

umm
Strlen(u8* cstring)
{
	umm result = 0;
	if (cstring) for (; cstring[result] != 0; ++result);

	return result;
}

String
String_FromCString(u8* cstring)
{
	return (String){
		.data = cstring,
		.size = Strlen(cstring),
	};
}

bool
String_Match(String s0, String s1)
{
